       IDENTIFICATION DIVISION.
       PROGRAM-ID. LESSON6.
       AUTHOR. BISOU.
       DATE-WRITTEN. 21-05-2026.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  IDX PIC 9(1) VALUE 0.

       PROCEDURE DIVISION.
           PERFORM OUTPUTDATA WITH TEST AFTER UNTIL IDX > 5.
           GO TO FORLOOP.

       OUTPUTDATA.
           DISPLAY IDX.
           ADD 1 TO IDX.

       FORLOOP.
           PERFORM OUTPUTDATA2 VARYING IDX FROM 1 BY 1 UNTIL IDX = 5.
           STOP RUN.

       OUTPUTDATA2.
           DISPLAY IDX.


    