       IDENTIFICATION DIVISION.
       PROGRAM-ID. LESSON8.
       AUTHOR. BISOU.
       DATE-WRITTEN. 21-05-2026.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  PRICE                PIC 9(4)V99.
       01  TAXRATE              PIC 9V999 VALUE 0.075.
       01  TAXMOUNT             PIC 9(4)V9999.
       01  FULLPRICE            PIC 9(4)V99.
       
       PROCEDURE DIVISION.
           DISPLAY "ENTER THE PRICE : " WITH NO ADVANCING.
           ACCEPT PRICE.

           COMPUTE TAXMOUNT = PRICE * TAXRATE.
           COMPUTE FULLPRICE ROUNDED = PRICE + TAXMOUNT.
           DISPLAY "PRICE + TAX : " FULLPRICE.

           STOP RUN.

